Revit 2026 API

# ScheduleHeightsOnSheet Class

---

Heights information of a schedule on sheet.

SystemObject Autodesk.Revit.DBScheduleHeightsOnSheet

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ScheduleHeightsOnSheet : IDisposable
```
```vb
Public Class ScheduleHeightsOnSheet
	Implements IDisposable
```
```cpp
public ref class ScheduleHeightsOnSheet : IDisposable
```
```fsharp
type ScheduleHeightsOnSheet =
    class
        interface IDisposable
    end
```

The ScheduleHeightsOnSheet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ColumnHeaderHeight | The height of all schedule header part, including the gap line between header and body. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | TitleHeight | The height of schedule title on sheet view. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ScheduleHeightsOnSheet |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetBodyRowHeights | Returns each row's height of schedule body on sheet view. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

This class returns the heights of schedule title, column header and each body row on sheet view.

#### Reference

Autodesk.Revit.DB Namespace